using Tyuiu.LavrinovichED.Sprint1.Task2.V8.Lib; 

//ЗАДАНИЕ
//Написать программу, которая запрашивает у пользователя исходные данные,
//выполняет указанные расчёты и печатает результат на экране.
//РАСЧЁТЫ: Известны длины стороны прямоугольникаю Вычислить периметр прямоугольника.
//Длина первой стороны прямоугольника (целое число).
//Длина второй длины прямоугольника (целое число)
//Периметр прямоугольника (целое число)

namespace Tyuiu.LavrinovichED.Sprint1.Task2.V8
{
    internal class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #1 | Выполнила: Лавринович Е.Д. | АСОиУБ - 24-1";
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* Спринт #1                                                                                *");
            Console.WriteLine("* Тема: Арифметические операторы в C#                                                      *");
            Console.WriteLine("* Задание #2                                                                               *");
            Console.WriteLine("* Вариант #8                                                                               *");
            Console.WriteLine("* Выполнила: Лавринович Елизавета Дмитриевна | АСОиУБ - 24-1                               *");
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                 *");
            Console.WriteLine("* Написать консольную программу, которая запришивает у пользователя исходные данные,       *");
            Console.WriteLine("* выполняет указанные расчёты и печатает результат на экране.                              *");
            Console.WriteLine("*                                                                                          *");
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                         *");
            Console.WriteLine("********************************************************************************************");

            int a, b;
            Console.WriteLine("Введите значение а = ");
            a = Convert.ToInt32(Console.ReadLine());

            Console.WriteLine("Введите значение b = ");
            b = Convert.ToInt32(Console.ReadLine());

            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("*РЕЗУЛЬТАТ:                                                                                *");
            Console.WriteLine("********************************************************************************************");

            Console.WriteLine("Периметр прямоугольника = " + ds.CalculatePerimetr(a, b));

            Console.ReadLine();
        }
    }
}
